#+property: header-args:elixir :dir "."
#+property: header-args:diff :results silent :dir "."
#+BEGIN_SRC emacs-lisp
(defun org-babel-execute:diff (body params)
  (let* ((tmp (org-babel-temp-file "patch-"))
         (cmd (concat "git apply " tmp))
         (file-a (assoc-default :file-a params))
         (file-b (assoc-default :file-b params)))
    (with-temp-file tmp
      (insert (concat
        "--- " file-a "\n"
        "+++ " file-b "\n"
        body)))
    (with-temp-buffer
      (async-shell-command cmd (current-buffer)))))
#+END_SRC
#+BEGIN_SRC emacs-lisp
(defun ob-elixir-ensure-session (session params)
  (let ((name (format "*elixir-%s*" session)))
    (unless (and (get-process name)
                 (process-live-p (get-process name)))
      (with-current-buffer (get-buffer-create name)
        (setq-local process-environment (cons "TERM=vt100" process-environment))
        (apply #'start-process name name "iex"
               (append (when (assoc :script params)
                         (list "-S" (assoc-default :script params)))
                       (when (assoc :sname params)
                         (list "--sname" (assoc-default :sname params)))
                       (when (assoc :name params)
                         (list "--name" (assoc-default :name params)))
                       (when (assoc :cookie params)
                         (list "--cookie" (assoc-default :cookie params)))
                       (when (assoc :remsh params)
                         (list "--remsh" (assoc-default :remsh params))))))
      (set-process-filter (get-process name) 'ob-elixir-process-filter)
      (ob-elixir-eval-in-repl session "IEx.configure(colors: [enabled: false])"))))
#+END_SRC
*** Создание схем

Т.к. в эликсире основная структурная единица -- модуль.

В эликсире имена модулей отражают файловую структуру проекта.

Добавляем документацию: `@moduledoc false`

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply.ex" :file-b "b/lib/notatwitter/user/post/reply.ex"
@@ -0,0 +1,3 @@
+defmodule Notatwitter.User.Post.Reply do
+  @moduledoc false
+end

#+END_SRC

Сказать, что такое Ecto.

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply.ex" :file-b "b/lib/notatwitter/user/post/reply.ex"
@@ -1,3 +1,6 @@
 defmodule Notatwitter.User.Post.Reply do
   @moduledoc false
+
+  use Ecto.Schema
+
 end

#+END_SRC

Так мы указываем имя таблицы, в которой будет храниться наша схема.

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply.ex" :file-b "b/lib/notatwitter/user/post/reply.ex"
@@ -3,4 +3,6 @@ defmodule Notatwitter.User.Post.Reply do
 
   use Ecto.Schema
 
+  schema "user_post_replies" do
+  end
 end

#+END_SRC

Добавляем полей в нашей схеме.

У нас уже есть схема Post и User, и мы хотим связать их отношением с
нашим Reply.

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply.ex" :file-b "b/lib/notatwitter/user/post/reply.ex"
@@ -4,5 +4,11 @@ defmodule Notatwitter.User.Post.Reply do
   use Ecto.Schema
 
   schema "user_post_replies" do
+    belongs_to :user, User
+    belongs_to :post, Post
+
+    field :text, :string
+
+    timestamps()
   end
 end

#+END_SRC

Сначала копипастим Notatwitter.User, а потом показываем, что можно
использовать alias.

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply.ex" :file-b "b/lib/notatwitter/user/post/reply.ex"
@@ -3,6 +3,9 @@ defmodule Notatwitter.User.Post.Reply do
 
   use Ecto.Schema
 
+  alias Notatwitter.User
+  alias Notatwitter.User.Post
+
   schema "user_post_replies" do
     belongs_to :user, User
     belongs_to :post, Post

#+END_SRC

Мы можем посмотреть, что получилось в схеме теперь:

#+BEGIN_SRC elixir :script mix :session new-session-1
alias Notatwitter.User.Post.Reply
%Reply{}
#+END_SRC

#+RESULTS:
#+begin_example
%Notatwitter.User.Post.Reply{
  __meta__: #Ecto.Schema.Metadata<:built, "user_post_replies">,
  id: nil,
  inserted_at: nil,
  post: #Ecto.Association.NotLoaded<association :post is not loaded>,
  post_id: nil,
  text: nil,
  updated_at: nil,
  user: #Ecto.Association.NotLoaded<association :user is not loaded>,
  user_id: nil
}
#+end_example

#+BEGIN_SRC elixir :script mix :session new-session-1
Reply.__info__(:functions)
#+END_SRC

#+RESULTS:
: [__changeset__: 0, __schema__: 1, __schema__: 2, __struct__: 0, __struct__: 1]

На этом схема описана и мы переходим от описания данных к работе
непосредственно с бизнес-логикой.

*** Работа со схемами

Мы напишем отдельный модуль с функциями бизнеслогики для наших реплаев.

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply/manager.ex" :file-b "b/lib/notatwitter/user/post/reply/manager.ex"
@@ -0,0 +1,3 @@
+defmodule Notatwitter.User.Post.Reply.Manager do
+  @moduledoc false
+end

#+END_SRC

Определим действия над реплаями.

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply/manager.ex" :file-b "b/lib/notatwitter/user/post/reply/manager.ex"
@@ -1,3 +1,12 @@
 defmodule Notatwitter.User.Post.Reply.Manager do
   @moduledoc false
+
+  def list(post_id) do
+  end
+
+  def create(user_id, post_id, attrs) do
+  end
+
+  def update(reply, attrs) do
+  end
 end

#+END_SRC

Здесь нам поможет один важный инстумент из Elixir, который есть во
многих функциональных языках программирования, -- пайпы.

Пайп -- оператор, который передаёт свой левый операнд первым
аргументом в функцию, вызов которой является его правым операндом.

#+BEGIN_SRC elixir
1 |> Kernel.+(2) |> to_string
#+END_SRC

#+RESULTS:
: "3"


Начнём со списка -- здесь нам понадобится Ecto.Query

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply/manager.ex" :file-b "b/lib/notatwitter/user/post/reply/manager.ex"
@@ -1,7 +1,16 @@
 defmodule Notatwitter.User.Post.Reply.Manager do
   @moduledoc false
 
+  import Ecto.Query
+
+  alias Notatwitter.Repo
+  alias Notatwitter.User.Post.Reply
+
   def list(post_id) do
+    Reply
+    |> where([r], r.post_id == ^post_id)
+    |> preload([:user])
+    |> Repo.all()
   end
 
   def create(user_id, post_id, attrs) do

#+END_SRC

Добавим создание и обновление

#+BEGIN_SRC diff :file-a "a/lib/notatwitter/user/post/reply/manager.ex" :file-b "b/lib/notatwitter/user/post/reply/manager.ex"
@@ -3,6 +3,7 @@ defmodule Notatwitter.User.Post.Reply.Manager do
 
   import Ecto.Query
 
+  alias Ecto.Changeset
   alias Notatwitter.Repo
   alias Notatwitter.User.Post.Reply
 
@@ -14,8 +15,22 @@ defmodule Notatwitter.User.Post.Reply.Manager do
   end
 
   def create(user_id, post_id, attrs) do
+    attrs = Map.merge(attrs, %{"user_id" => user_id, "post_id" => post_id})
+
+    %Reply{}
+    |> Changeset.cast(attrs, [:text, :user_id, :post_id])
+    |> Changeset.foreign_key_constraint(:user_id)
+    |> Changeset.foreign_key_constraint(:post_id)
+    |> Changeset.validate_required([:text, :user_id, :post_id])
+    |> Changeset.validate_length(:text, max: 140, count: :bytes)
+    |> Repo.insert()
   end
 
   def update(reply, attrs) do
+    reply
+    |> Changeset.cast(attrs, [:text])
+    |> Changeset.validate_length(:text, max: 140, count: :bytes)
+    |> Changeset.validate_required([:text, :user_id, :post_id])
+    |> Repo.update()
   end
 end

#+END_SRC

У нас очень сложная бизнес-логика.

Теперь можно проверить работу нашего модуля

#+BEGIN_SRC elixir :script mix :session new-session-1
alias Notatwitter.Users
user = Users.list_users() |> hd
#+END_SRC

#+RESULTS:
#+begin_example
[36m[debug] QUERY OK source="users" db=2.9ms queue=0.1ms
SELECT u0."id", u0."username", u0."avatar", u0."inserted_at", u0."updated_at" FROM "users" AS u0 []
[0m %Notatwitter.User{
  __meta__: #Ecto.Schema.Metadata<:loaded, "users">,
  avatar: nil,
  followers: #Ecto.Association.NotLoaded<association :followers is not loaded>,
  follows: #Ecto.Association.NotLoaded<association :follows is not loaded>,
  id: 1,
  inserted_at: ~N[2019-11-10 14:53:17],
  posts: #Ecto.Association.NotLoaded<association :posts is not loaded>,
  updated_at: ~N[2019-11-10 14:53:17],
  username: "test"
}
#+end_example

#+BEGIN_SRC elixir :script mix :session new-session-1
{:ok, post} = Users.create_post(user.id, %{"text" => "post text"})
#+END_SRC

#+RESULTS:
#+begin_example
[32m[debug] QUERY OK db=12.2ms queue=2.7ms
INSERT INTO "user_posts" ("text","user_id","inserted_at","updated_at") VALUES ($1,$2,$3,$4) RETURNING "id" ["post text", 1, ~N[2020-02-24 16:30:54], ~N[2020-02-24 16:30:54]]
[0m [36m[debug] QUERY OK source="users" db=4.5ms queue=0.1ms
SELECT u0."id", u0."username", u0."avatar", u0."inserted_at", u0."updated_at", u0."id" FROM "users" AS u0 WHERE (u0."id" = $1) [1]
[0m {:ok,
 %Notatwitter.User.Post{
   __meta__: #Ecto.Schema.Metadata<:loaded, "user_posts">,
   id: 5,
   inserted_at: ~N[2020-02-24 16:30:54],
   text: "post text",
   updated_at: ~N[2020-02-24 16:30:54],
   user: %Notatwitter.User{
     __meta__: #Ecto.Schema.Metadata<:loaded, "users">,
     avatar: nil,
     followers: #Ecto.Association.NotLoaded<association :followers is not loaded>,
     follows: #Ecto.Association.NotLoaded<association :follows is not loaded>,
     id: 1,
     inserted_at: ~N[2019-11-10 14:53:17],
     posts: #Ecto.Association.NotLoaded<association :posts is not loaded>,
     updated_at: ~N[2019-11-10 14:53:17],
     username: "test"
   },
   user_id: 1
 }}
#+end_example

#+BEGIN_SRC elixir :script mix :session new-session-1
alias Notatwitter.User.Post.Reply.Manager
{:ok, reply} = Manager.create(user.id, post.id, %{"text" => "reply text"})
#+END_SRC

#+RESULTS:
#+begin_example
[32m[debug] QUERY OK db=64.4ms queue=2.1ms
INSERT INTO "user_post_replies" ("post_id","text","user_id","inserted_at","updated_at") VALUES ($1,$2,$3,$4,$5) RETURNING "id" [5, "reply text", 1, ~N[2020-02-24 16:32:03], ~N[2020-02-24 16:32:03]] 
[0m [36m[debug] QUERY OK source="users" db=3.0ms queue=0.1ms
SELECT u0."id", u0."username", u0."avatar", u0."inserted_at", u0."updated_at", u0."id" FROM "users" AS u0 WHERE (u0."id" = $1) [1]
[0m {:ok,
 %Notatwitter.User.Post.Reply{
   __meta__: #Ecto.Schema.Metadata<:loaded, "user_post_replies">,
   id: 6,
   inserted_at: ~N[2020-02-24 16:32:03],
   post: #Ecto.Association.NotLoaded<association :post is not loaded>,
   post_id: 5,
   text: "reply text",
   updated_at: ~N[2020-02-24 16:32:03],
   user: %Notatwitter.User{
     __meta__: #Ecto.Schema.Metadata<:loaded, "users">,
     avatar: nil,
     followers: #Ecto.Association.NotLoaded<association :followers is not loaded>,
     follows: #Ecto.Association.NotLoaded<association :follows is not loaded>,
     id: 1,
     inserted_at: ~N[2019-11-10 14:53:17],
     posts: #Ecto.Association.NotLoaded<association :posts is not loaded>,
     updated_at: ~N[2019-11-10 14:53:17],
     username: "test"
   },
   user_id: 1
 }}
#+end_example

#+BEGIN_SRC elixir :script mix :session new-session-1
{:ok, updated_reply} = Manager.update(reply, %{"text" => "new reply text"})
#+END_SRC

#+RESULTS:
#+begin_example
[33m[debug] QUERY OK db=38.0ms queue=2.5ms
UPDATE "user_post_replies" SET "text" = $1, "updated_at" = $2 WHERE "id" = $3 ["new reply text", ~N[2020-02-24 16:32:50], 6]
[0m {:ok,
 %Notatwitter.User.Post.Reply{
   __meta__: #Ecto.Schema.Metadata<:loaded, "user_post_replies">,
   id: 6,
   inserted_at: ~N[2020-02-24 16:32:03],
   post: #Ecto.Association.NotLoaded<association :post is not loaded>,
   post_id: 5,
   text: "new reply text",
   updated_at: ~N[2020-02-24 16:32:50],
   user: %Notatwitter.User{
     __meta__: #Ecto.Schema.Metadata<:loaded, "users">,
     avatar: nil,
     followers: #Ecto.Association.NotLoaded<association :followers is not loaded>,
     follows: #Ecto.Association.NotLoaded<association :follows is not loaded>,
     id: 1,
     inserted_at: ~N[2019-11-10 14:53:17],
     posts: #Ecto.Association.NotLoaded<association :posts is not loaded>,
     updated_at: ~N[2019-11-10 14:53:17],
     username: "test"
   },
   user_id: 1
 }}
#+end_example

#+BEGIN_SRC elixir :script mix :session new-session-1
Manager.list(post.id)
#+END_SRC

#+RESULTS:
#+begin_example
[36m[debug] QUERY OK source="user_post_replies" db=1.1ms queue=1.3ms
SELECT u0."id", u0."user_id", u0."post_id", u0."text", u0."inserted_at", u0."updated_at" FROM "user_post_replies" AS u0 WHERE (u0."post_id" = $1) [5]
[0m [36m[debug] QUERY OK source="users" db=0.7ms queue=0.1ms
SELECT u0."id", u0."username", u0."avatar", u0."inserted_at", u0."updated_at", u0."id" FROM "users" AS u0 WHERE (u0."id" = $1) [1]
[0m [
  %Notatwitter.User.Post.Reply{
    __meta__: #Ecto.Schema.Metadata<:loaded, "user_post_replies">,
    id: 6,
    inserted_at: ~N[2020-02-24 16:32:03],
    post: #Ecto.Association.NotLoaded<association :post is not loaded>,
    post_id: 5,
    text: "new reply text",
    updated_at: ~N[2020-02-24 16:32:50],
    user: %Notatwitter.User{
      __meta__: #Ecto.Schema.Metadata<:loaded, "users">,
      avatar: nil,
      followers: #Ecto.Association.NotLoaded<association :followers is not loaded>,
      follows: #Ecto.Association.NotLoaded<association :follows is not loaded>,
      id: 1,
      inserted_at: ~N[2019-11-10 14:53:17],
      posts: #Ecto.Association.NotLoaded<association :posts is not loaded>,
      updated_at: ~N[2019-11-10 14:53:17],
      username: "test"
    },
    user_id: 1
  }
]
#+end_example

